[
    {
      "_id": "61fb989256f61bab608dc4d2",
      "content": "We’ve been working with the team at Tonneson + Co for over 35 years. Their work is timely and accurate, and they are a pleasure to work with. Their team stays current on tax and estate laws, always putting client concerns first. Tonneson is a valuable business partner, playing a key role in our success.",
      "name": "Michael Tamasi",
      "job": "PRESIDENT & CEO, ACCUROUNDS"
    },
    {
      "_id": "61fb98922547ddb0d59c98ba",
      "content": "We have been a client of Tonneson since 1988. We are a small family Logistics company that requires specific financial needs. We have always relied on Tonneson to provide us with the financial expertise that is necessary to secure the financing for working capital and equipment purchases. We have gone through several audits and because of the detailed auditing process that Tonneson provides, our experience has been painless. They have been responsive to all our requests and needs. Our business continues to grow and knowing we have Tonneson as our financial partner makes the journey a little easier.",
      "name": "Michael O'Brien",
      "job": "CEO, Eagle Air Freight, Inc."
    },
    {
      "_id": "61fb98921eacae6e7fe57679",
      "content": "We have been a client of Tonneson for 4 decades. We have always received sound financial advice and excellent accounting services over the years. We consider Tonneson to be one of our highly trusted partners.",
      "name": "Steven Tamasi",
      "job": "President, Boston Centerless"
    },
    {
      "_id": "61fb9892c2a1fb24a0d20157",
      "content": "We have been a client of Tonneson since 1988. We are a small family Logistics company that requires specific financial needs. We have always relied on Tonneson to provide us with the financial expertise that is necessary to secure the financing for working capital and equipment purchases. We have gone through several audits and because of the detailed auditing process that Tonneson provides, our experience has been painless. They have been responsive to all our requests and needs. Our business continues to grow and knowing we have Tonneson as our financial partner makes the journey a little easier.",
      "name": "Michael O'Brien",
      "job": "CEO, Eagle Air Freight, Inc."
    }
  ]